{
  "id": "trac_app",
  "project_name": "TRAC App – Tracking Remote Activity Control Application",
  "headline": "TRAC App: Real-Time Tracking & Remote Activity Control Across Distributed Devices",
  "short_headline": "TRAC App – Tracking Remote Activity Control",
  "taglines": [
    "See every critical device, from anywhere.",
    "Tracking. Remote access. Activity control. In one dashboard.",
    "Bring order and visibility to your distributed machines.",
    "From blind remote work to fully observable systems.",
    "Monitor, manage, and control — without leaving your desk."
  ],
  "client": {
    "brand_name_current": "TRAC App",
    "full_form": "Tracking Remote Activity Control",
    "industry": "Productivity / IT Management / Remote Monitoring",
    "location": "India (remote-friendly, global use-case)",
    "audience": [
      "Small and mid-size teams with remote devices",
      "IT admins and operations teams",
      "Computer labs, training centres, and classrooms",
      "Founders who need visibility into distributed machines"
    ]
  },
  "studio": {
    "owned_by": "Dipankar Chowdhury",
    "brand": "Dew & Company (DewCo)",
    "parent_company": "Gloventis Solution"
  },
  "snapshot": {
    "role": [
      "Product Concept & System Design",
      "UX/UI Design for Dashboard and Agent Controls",
      "Backend & API Engineering",
      "Desktop Agent Architecture",
      "Automation & Alerting"
    ],
    "platform": [
      "Web Dashboard (Admin & Monitoring)",
      "Desktop/Endpoint Agent",
      "API Layer & Notification Channel"
    ],
    "project_type": "In-house product (remote activity tracking & control platform)",
    "status": "Active – internal deployment & ongoing refinement",
    "project_start_date": "2024-04-01",
    "initial_launch_date": "2024-09-15",
    "completed_date_v1": "2024-10-15",
    "engagement_model": "Internal product build with future SaaS/seat-based licensing plan"
  },
  "about": {
    "short": "TRAC App (Tracking Remote Activity Control) is a monitoring and control platform that lets you track the status, activity, and usage of remote devices from a single dashboard, with the ability to trigger safe remote actions like lock, restart, or app-level controls.",
    "long": "TRAC App was built to solve a recurring problem in distributed teams, computer labs, and shared work environments: once machines are remote, it becomes very hard to know who is doing what, which devices are idle, which are overloaded, and how to act quickly when something goes wrong.\n\nTRAC combines a lightweight endpoint/desktop agent with a central web dashboard. The agent runs on each machine, periodically sending status and activity signals (online/offline, active user, running apps, CPU/RAM load, optional screenshots or window titles). From the dashboard, admins can see all devices at a glance, drill into a specific machine, and execute safe remote actions such as lock screen, log out current user, restart, or trigger a pre-defined command.\n\nUnlike heavy enterprise tools, TRAC is designed to be simple, scriptable, and brandable. It can be used in offices, training centres, small labs, or within a founder’s own ecosystem of devices, making it a core utility for future automation and control workflows in the DewCo / Gloventis ecosystem."
  },
  "roles_and_responsibilities": [
    "Defined the product scope for a lightweight, scriptable remote activity tracking and control tool.",
    "Designed the information architecture and UX for the central TRAC dashboard (device list, detail view, actions).",
    "Modeled data for devices, heartbeats, sessions, activity logs, and control events.",
    "Implemented backend APIs to collect agent signals and expose them securely to the dashboard.",
    "Designed and prototyped the desktop agent (installer, configuration, background service).",
    "Set up alert pipelines (e.g., email/notification on offline/critical devices or unusual activity)."
  ],
  "objectives": [
    "Provide a single-pane-of-glass view of all critical devices, whether in-office or remote.",
    "Track online/offline status, current user, and high-level activity in near real-time.",
    "Allow safe, auditable remote actions (lock, restart, run command, notify user).",
    "Log historical activity so patterns (idle times, usage spikes, downtime) can be understood.",
    "Make the architecture modular so TRAC can later integrate with other DewCo products and external systems."
  ],
  "features": {
    "device_and_activity_tracking": [
      "Device registration with unique ID, hostname, tags (location, team, purpose).",
      "Online/offline status with last-seen timestamps (heartbeats).",
      "Current user and active session information where supported.",
      "High-level resource stats: CPU, memory, disk usage snapshots.",
      "Optional activity hints (active window title, basic app list, or categorized usage, configurable for privacy)."
    ],
    "remote_control_actions": [
      "Remote lock screen / sign out current user (OS-supported).",
      "Safe restart/shutdown commands with confirmation.",
      "Trigger custom scripts or commands defined in admin panel (e.g., restart a service, clear temp files).",
      "Send on-screen notification/message to the user for instructions or warnings.",
      "All actions logged with who triggered them and when."
    ],
    "dashboard_and_ux": [
      "Global device list view with search, filters (status, tag, location, OS).",
      "Per-device detail page with timeline of status, actions, and activity logs.",
      "Color-coded health/status indicators (Online, Idle, Busy, Offline, Attention).",
      "Quick actions from the list (e.g., Lock, Ping, Open detail view).",
      "Responsive layout optimized for desktop admins, with basic mobile-friendly overview."
    ],
    "alerts_and_reporting": [
      "Configurable alerts for offline devices, high CPU/RAM, or no activity for X minutes/hours.",
      "Optional alerts for unauthorized usage windows (e.g., activity outside office hours).",
      "Daily/weekly summary reports of uptime, incidents, and remote actions executed.",
      "Audit log of all control actions and configuration changes."
    ],
    "security_and_privacy_controls": [
      "Agent authentication using API keys or device tokens.",
      "Role-based access control on dashboard (Owner, Admin, Viewer).",
      "Granular toggles to enable/disable screenshots or app-level tracking per device.",
      "Encryption in transit for agent-to-server communication."
    ],
    "admin_and_configuration": [
      "Group devices by department, project, lab, or location.",
      "Define policy profiles (e.g., strict lab mode vs. light monitoring mode).",
      "Configure which remote actions are allowed per role.",
      "Export logs for compliance or troubleshooting."
    ]
  },
  "tech_stack": {
    "backend": [
      "Python backend using FastAPI / Django REST Framework for APIs.",
      "Background workers/cron jobs for processing heartbeats and generating alerts.",
      "WebSockets or long-poll channels (optional) for more real-time updates to the dashboard."
    ],
    "agent_side": [
      "Lightweight desktop agent (e.g., Python/Go/.NET depending on OS) running as background service.",
      "OS integration for system metrics and remote commands (lock, restart, etc.).",
      "Config file or environment-based provisioning for registration and server URL."
    ],
    "frontend": [
      "React / Next.js-based admin dashboard.",
      "Reusable components for device tables, status badges, and activity timelines.",
      "Charts and visualizations built with a standard JS charting library."
    ],
    "data_and_storage": [
      "PostgreSQL for devices, users, actions, and logs.",
      "Time-series style tables for heartbeats and resource metrics.",
      "Redis (optional) for caching latest device states for quick UI fetch."
    ],
    "integrations": [
      "Email provider or webhook endpoints for alerts.",
      "Pluggable notification channels (Slack/Telegram-style webhooks – roadmap).",
      "API endpoints for other internal systems to query device status programmatically."
    ],
    "hosting_devops": [
      "Containerized services (Docker) for backend, dashboard, and worker processes.",
      "Deployed on VPS/cloud with environment-based configuration (dev/stage/prod).",
      "Monitoring for the TRAC backend itself (health checks, log aggregation)."
    ]
  },
  "timeline": {
    "ideation_and_need_validation": {
      "phase": "Ideation & Need Validation",
      "start": "2024-04-01",
      "end": "2024-04-30",
      "summary": "Identified the need for a lightweight remote activity and control tool for distributed machines within the DewCo/Gloventis ecosystem."
    },
    "architecture_and_design": {
      "phase": "Architecture & UX Design",
      "start": "2024-05-01",
      "end": "2024-06-15",
      "summary": "Designed the agent–server–dashboard architecture and the UX for device lists, detail views, and remote actions."
    },
    "development_v1": {
      "phase": "Core Development v1",
      "start": "2024-06-16",
      "end": "2024-09-14",
      "summary": "Implemented core backend APIs, basic agent, and initial dashboard for internal usage."
    },
    "internal_launch": {
      "phase": "Internal Launch / Dogfooding",
      "date": "2024-09-15",
      "summary": "Deployed TRAC App on a small set of internal machines to test stability, usability, and control actions."
    },
    "v1_hardening": {
      "phase": "Stabilization & Logging/Alerting Enhancements",
      "start": "2024-09-16",
      "end": "2024-10-15",
      "summary": "Improved logging, alerts, and safety checks for remote actions; refined UI based on internal feedback."
    },
    "ongoing_improvements": {
      "phase": "Ongoing Enhancements & SaaS Readiness",
      "start": "2024-10-16",
      "end": null,
      "summary": "Preparing multi-tenant support, role-based access improvements, and advanced reporting for potential SaaS rollout."
    }
  },
  "budget": {
    "currency": "INR",
    "internal_build_equivalent": 190000,
    "internal_build_range": [160000, 230000],
    "notes": "Represents equivalent commercial project value, including system design, backend, agent development, dashboard, and alerting. As an in-house utility, cost is primarily internal engineering time and infra."
  },
  "challenges": [
    "Designing an agent that is powerful enough to provide meaningful signals but lightweight and stable for always-on use.",
    "Balancing visibility (metrics, activity hints) with privacy and trust requirements.",
    "Handling intermittent connectivity and ensuring the dashboard reflects accurate, recent states.",
    "Making remote actions safe and auditable so accidental misuse is minimized.",
    "Keeping the UI simple enough for non-technical admins while still exposing advanced filters and logs."
  ],
  "solutions": [
    "Kept the agent architecture modular with separate modules for metrics, activity hints, and control, so features can be enabled/disabled per deployment.",
    "Introduced per-device and per-policy toggles for what data is collected (e.g., metrics only vs. metrics + activity hints).",
    "Implemented heartbeats with clear last-seen timestamps and simple state logic so admins can trust what they see.",
    "Logged all remote actions with user, time, and device, and added confirmation prompts for sensitive operations like shutdown.",
    "Designed the dashboard around a clean device list + detail pattern, with filters and advanced logs tucked behind simple defaults."
  ],
  "outcomes": {
    "qualitative": [
      "Provided a clear real-time view of internal machines, reducing guesswork about which devices are online or idle.",
      "Enabled quick, centralized responses to issues (e.g., locking or restarting a problematic machine) without physical access.",
      "Created a reusable foundation for future automation workflows (e.g., auto-healing scripts, scheduled maintenance).",
      "Positioned TRAC App as a core infrastructure utility in the DewCo / Gloventis ecosystem for future SaaS/enterprise offerings."
    ],
    "example_metrics_note": "As an internal-first tool, success is measured in reduced manual checks, faster incident response, and improved visibility rather than public usage numbers. External-facing metrics can be added later if TRAC is commercialized."
  },
  "portfolio_copy": {
    "grid_card": "TRAC App – Tracking Remote Activity Control platform that gives you a live view of all your machines and lets you execute safe remote actions from a single dashboard.",
    "one_liner": "A remote activity tracking and control application that monitors distributed devices in real time and gives admins safe, auditable remote control over them."
  },
  "links": {
    "live_dashboard": null,
    "agent_download": null,
    "case_study_page": null,
    "github_or_repo": null
  },
  "meta": {
    "last_updated_for_portfolio": "2025-12-23",
    "notes_for_future_edit": "Replace placeholder dates and ranges with your exact internal milestones, and add real URLs/screenshots once you’re ready to show TRAC publicly."
  }
}
